[
  {
    "id": "proj-lazulinile",
    "title": {
      "en": "Full-Stack Agency Website",
      "fr": "Site Web d'Agence Full-Stack",
      "ar": "موقع وكالة متكامل"
    },
    "summary": {
      "en": "A bespoke, multi-language, and responsive commercial website for a French travel agency.",
      "fr": "Un site web commercial sur mesure, multilingue et adaptatif pour une agence de voyage française.",
      "ar": "موقع تجاري مخصص متعدد اللغات ومتجاوب لوكالة سفر فرنسية."
    },
    "description": {
      "en": "This project involved the end-to-end development of a commercial website for Lazulinile, a French travel agency. The primary objective was to create a professional, multi-language digital presence to attract an international clientele and showcase their travel packages.\n\nThe website is built on a modern web stack, featuring a responsive front-end that ensures a seamless user experience across all devices. A key architectural feature is its robust internationalization (i18n) framework, which allows for easy content management in multiple languages. The backend securely handles content delivery and client contact forms.\n\nThe final product is a live, performant website currently serving the client's business needs. The GitHub repository is private to protect proprietary client information and business logic.",
      "fr": "Ce projet a impliqué le développement de bout en bout d'un site web commercial pour Lazulinile, une agence de voyage française. L'objectif principal était de créer une présence numérique professionnelle et multilingue pour attirer une clientèle internationale et présenter leurs offres de voyage.\n\nLe site est construit sur une pile web moderne, avec un front-end adaptatif qui garantit une expérience utilisateur fluide sur tous les appareils. Une caractéristique architecturale clé est son cadre d'internationalisation (i18n) robuste, qui permet une gestion facile du contenu en plusieurs langues. Le backend gère en toute sécurité la livraison de contenu et les formulaires de contact client.\n\nLe produit final est un site web performant et en ligne qui répond actuellement aux besoins commerciaux du client. Le dépôt GitHub est privé pour protéger les informations propriétaires et la logique métier du client.",
      "ar": "شمل هذا المشروع التطوير الشامل لموقع ويب تجاري لوكالة سفر فرنسية تدعى لازولينيل. كان الهدف الأساسي هو إنشاء وجود رقمي احترافي متعدد اللغات لجذب عملاء دوليين وعرض باقات السفر الخاصة بهم.\n\nتم بناء الموقع على حزمة تقنيات ويب حديثة، ويتميز بواجهة أمامية متجاوبة تضمن تجربة مستخدم سلسة عبر جميع الأجهزة. من السمات المعمارية الرئيسية إطار التدويل (i18n) القوي، والذي يسمح بإدارة سهلة للمحتوى بلغات متعددة. تتعامل الواجهة الخلفية بشكل آمن مع تسليم المحتوى ونماذج الاتصال بالعملاء.\n\nالمنتج النهائي هو موقع ويب مباشر وعالي الأداء يخدم حاليًا احتياجات العميل التجارية. مستودع GitHub خاص لحماية معلومات العميل المسجلة والمنطق التجاري."
    },
    "images": ["images/preview.png"],
    "tags": ["Full-Stack", "Web Development", "JavaScript", "i18n"],
    "github": null,
    "demo": "https://lazulinile.com"
  },
  {
    "id": "proj-fullstack-crypto",
    "title": {
      "en": "Full-Stack Blockchain Simulator",
      "fr": "Simulateur de Blockchain Full-Stack",
      "ar": "محاكي بلوكتشين متكامل"
    },
    "summary": {
      "en": "A full-stack web application featuring a functional blockchain simulation in Python.",
      "fr": "Une application web full-stack avec une simulation fonctionnelle de blockchain en Python.",
      "ar": "تطبيق ويب متكامل يتميز بمحاكاة بلوكتشين وظيفية بلغة بايثون."
    },
    "description": {
      "en": "This project serves as a proof-of-concept for a full-stack cryptocurrency platform, designed to demonstrate a comprehensive understanding of both blockchain fundamentals and web application architecture.\n\nThe backend is implemented from scratch in Python and simulates a complete blockchain. It includes core functionalities such as cryptographic hashing, a proof-of-work mining algorithm, and transaction validation. A RESTful API connects the client to the blockchain backend.\n\nThe system features a robust user authentication layer. Transactions are broadcast to the network and are only considered final once they are included in a successfully mined block, accurately mimicking the behavior of real-world cryptocurrencies.",
      "fr": "Ce projet sert de preuve de concept pour une plateforme de cryptomonnaie full-stack, conçue pour démontrer une compréhension complète des principes fondamentaux de la blockchain et de l'architecture des applications web.\n\nLe backend est implémenté à partir de zéro en Python et simule une blockchain complète. Il inclut des fonctionnalités de base telles que le hachage cryptographique, un algorithme de minage par preuve de travail et la validation des transactions. Une API RESTful connecte le client au backend de la blockchain.\n\nLe système dispose d'une couche d'authentification utilisateur robuste. Les transactions sont diffusées sur le réseau et ne sont considérées comme définitives qu'une fois incluses dans un bloc miné avec succès, imitant ainsi fidèlement le comportement des cryptomonnaies réelles.",
      "ar": "يعمل هذا المشروع كإثبات لمفهوم منصة عملات مشفرة متكاملة، مصممة لإظهار فهم شامل لكل من أساسيات البلوكتشين وهندسة تطبيقات الويب.\n\nتم تنفيذ الواجهة الخلفية من الصفر بلغة بايثون وهي تحاكي بلوكتشين كاملة. تتضمن وظائف أساسية مثل التجزئة المشفرة، وخوارزمية إثبات العمل للتعدين، والتحقق من صحة المعاملات. تربط واجهة برمجة تطبيقات RESTful العميل بالواجهة الخلفية للبلوكتشين.\n\nيتميز النظام بطبقة مصادقة مستخدم قوية. يتم بث المعاملات إلى الشبكة ولا تعتبر نهائية إلا بعد تضمينها في كتلة تم تعدينها بنجاح، مما يحاكي بدقة سلوك العملات المشفرة في العالم الحقيقي."
    },
    "images": ["images/preview.png"],
    "tags": ["Full-Stack", "Python", "Blockchain", "REST API"],
    "github": "https://github.com/AlanMet/Full-Stack-Crypto",
    "demo": null
  },
  {
    "id": "proj-study-buddy",
    "title": {
      "en": "Secure Mobile Collaboration Platform",
      "fr": "Plateforme Mobile de Collaboration Sécurisée",
      "ar": "منصة تعاون متنقلة آمنة"
    },
    "summary": {
      "en": "A secure, Flutter-based mobile platform for student collaboration and scheduling.",
      "fr": "Une plateforme mobile sécurisée, basée sur Flutter, pour la collaboration et la planification étudiante.",
      "ar": "منصة متنقلة آمنة تعتمد على Flutter لتعاون الطلاب وجدولة المواعيد."
    },
    "description": {
      "en": "This project was a team-led effort to develop a mobile application aimed at facilitating student collaboration. The core objective was to build a secure and intuitive platform where students could connect, schedule study sessions, and share academic content.\n\nThe application was built using Flutter for cross-platform deployment and utilized a SQL database for data persistence. A key personal contribution was the design and implementation of the security architecture. This included robust password hashing and a novel, email-less account recovery mechanism to enhance user privacy and security.\n\nFunctionality included a dynamic content feed with video support, a scheduling system that integrated with a user's personal calendar, and social features like posting and liking. The project demonstrated skills in team leadership, mobile development, and secure application design.",
      "fr": "Ce projet était un effort d'équipe visant à développer une application mobile pour faciliter la collaboration étudiante. L'objectif principal était de construire une plateforme sécurisée et intuitive où les étudiants pourraient se connecter, planifier des sessions d'étude et partager du contenu académique.\n\nL'application a été développée avec Flutter pour un déploiement multiplateforme et utilisait une base de données SQL pour la persistance des données. Une contribution personnelle clé a été la conception et la mise en œuvre de l'architecture de sécurité. Cela comprenait un hachage de mot de passe robuste et un mécanisme de récupération de compte novateur sans e-mail pour améliorer la confidentialité et la sécurité des utilisateurs.\n\nLes fonctionnalités incluaient un fil de contenu dynamique avec prise en charge de la vidéo, un système de planification intégré au calendrier personnel de l'utilisateur et des fonctionnalités sociales comme la publication et les 'j'aime'. Le projet a démontré des compétences en leadership d'équipe, en développement mobile et en conception d'applications sécurisées.",
      "ar": "كان هذا المشروع جهدًا قاده فريق لتطوير تطبيق محمول يهدف إلى تسهيل تعاون الطلاب. كان الهدف الأساسي هو بناء منصة آمنة وبديهية حيث يمكن للطلاب التواصل وجدولة جلسات الدراسة ومشاركة المحتوى الأكاديمي.\n\nتم بناء التطبيق باستخدام Flutter للنشر عبر المنصات واستخدم قاعدة بيانات SQL لاستمرارية البيانات. كانت المساهمة الشخصية الرئيسية هي تصميم وتنفيذ بنية الأمان. وشمل ذلك تجزئة قوية لكلمات المرور وآلية جديدة لاستعادة الحساب بدون بريد إلكتروني لتعزيز خصوصية المستخدم وأمانه.\n\nشملت الوظائف موجز محتوى ديناميكي مع دعم الفيديو، ونظام جدولة يتكامل مع تقويم المستخدم الشخصي، وميزات اجتماعية مثل النشر والإعجاب. أظهر المشروع مهارات في قيادة الفريق، وتطوير الأجهزة المحمولة، وتصميم التطبيقات الآمنة."
    },
    "images": ["images/preview.png"],
    "tags": ["Leadership", "Flutter", "SQL", "Security", "Mobile Development"],
    "github": "https://github.com/AlanMet/StudyBuddyFinder",
    "demo": null
  },
  {
    "id": "proj-fl-research",
    "title": {
      "en": "Novel FL Attack & Defense",
      "fr": "Nouvelles Attaques & Défenses FL",
      "ar": "هجوم ودفاع FL مبتكر"
    },
    "summary": {
      "en": "Researched and implemented new attack and defense mechanisms for federated learning.",
      "fr": "Recherche et implémentation de nouveaux mécanismes d'attaque et de défense pour l'apprentissage fédéré.",
      "ar": "بحث وتنفيذ آليات هجوم ودفاع جديدة للتعلم الفيدرالي."
    },
    "description": {
      "en": "This research addresses critical security vulnerabilities in Federated Learning (FL). In collaboration with AI researchers, the project involved creating and formalizing novel attack methodologies to rigorously test system resilience, alongside developing new defense mechanisms to counteract these threats. This included designing algorithms capable of identifying and isolating malicious model updates.\n\nThe AI model's purpose was to classify different types of Dark Net traffic. The attacks and defenses were implemented in Python, and the results, visualized in graphs, demonstrate a significant improvement in model robustness against advanced attacks, contributing to the development of more trustworthy distributed AI systems.",
      "fr": "Cette recherche aborde les vulnérabilités de sécurité critiques de l'Apprentissage Fédéré (FL). En collaboration avec des chercheurs en IA, le projet a consisté à créer et à formaliser de nouvelles méthodologies d'attaque pour tester rigoureusement la résilience du système, tout en développant de nouveaux mécanismes de défense pour contrer ces menaces. Cela comprenait la conception d'algorithmes capables d'identifier et d'isoler les mises à jour de modèles malveillantes.\n\nL'objectif du modèle d'IA était de classifier différents types de trafic du Dark Net. Les attaques et les défenses ont été implémentées en Python, et les résultats, visualisés dans des graphiques, démontrent une amélioration significative de la robustesse du modèle contre les attaques avancées, contribuant ainsi au développement de systèmes d'IA distribués plus fiables.",
      "ar": "يتناول هذا البحث الثغرات الأمنية الحرجة في التعلم الفيدرالي (FL). بالتعاون مع باحثي الذكاء الاصطناعي، تضمن المشروع إنشاء وتأطير منهجيات هجوم مبتكرة لاختبار مرونة النظام بدقة، إلى جانب تطوير آليات دفاع جديدة لمواجهة هذه التهديدات. وشمل ذلك تصميم خوارزميات قادرة على تحديد وعزل تحديثات النموذج الخبيثة.\n\nكان الغرض من نموذج الذكاء الاصطناعي هو تصنيف أنواع مختلفة من حركة مرور الشبكة المظلمة. تم تنفيذ الهجمات والدفاعات بلغة بايثون، وتظهر النتائج، التي تم تصورها في الرسوم البيانية، تحسنًا كبيرًا في متانة النموذج ضد الهجمات المتقدمة، مما يساهم في تطوير أنظمة ذكاء اصطناعي موزعة أكثر جدارة بالثقة."
    },
    "images": ["images/preview.png"],
    "tags": ["Research", "Cybersecurity", "Python", "Machine Learning"],
    "github": "https://github.com/AlanMet/FL-Research",
    "demo": null
  },
  {
    "id": "proj-dart-nn",
    "title": {
      "en": "Neural Network from Scratch",
      "fr": "Réseau Neuronal de Zéro",
      "ar": "شبكة عصبية من الصفر"
    },
    "summary": {
      "en": "A multi-layered neural network library built from scratch in Dart.",
      "fr": "Une bibliothèque de réseau neuronal multicouche entièrement créée en Dart.",
      "ar": "مكتبة شبكة عصبية متعددة الطبقات مبنية من الصفر في لغة دارت."
    },
    "description": {
      "en": "The objective of this project was to build a comprehensive neural network library from the ground up entirely in Dart. This endeavor was driven by a desire to deeply understand the core mechanics of machine learning, from data structures to backpropagation.\n\nThe library features a flexible, multi-layered architecture for deep neural networks, supporting standard activation functions. It is built upon a custom Dart Matrix library, ensuring all underlying mathematical operations are efficient. Despite challenges with Dart's numerical precision, the library successfully predicted a sine wave function with 92% accuracy across 10,000 data points, validating its core functionality.",
      "fr": "L'objectif de ce projet était de construire une bibliothèque de réseau neuronal complète à partir de zéro, entièrement en Dart. Cette démarche était motivée par le désir de comprendre en profondeur les mécanismes de base de l'apprentissage automatique, des structures de données à la rétropropagation.\n\nLa bibliothèque dispose d'une architecture flexible et multicouche pour les réseaux de neurones profonds, prenant en charge les fonctions d'activation standard. Elle est construite sur une bibliothèque matricielle personnalisée Dart, garantissant que toutes les opérations mathématiques sous-jacentes sont efficaces. Malgré les défis liés à la précision numérique de Dart, la bibliothèque a réussi à prédire une fonction sinusoïdale avec une précision de 92 % sur 10 000 points de données, validant ainsi ses fonctionnalités de base.",
      "ar": "كان الهدف من هذا المشروع هو بناء مكتبة شبكة عصبية شاملة من الصفر بالكامل بلغة دارت. كان هذا المسعى مدفوعًا بالرغبة في فهم الآليات الأساسية للتعلم الآلي بعمق، من هياكل البيانات إلى الانتشار العكسي.\n\nتتميز المكتبة ببنية مرنة متعددة الطبقات للشبكات العصبية العميقة، وتدعم وظائف التنشيط القياسية. وهي مبنية على مكتبة مصفوفات دارت المخصصة، مما يضمن أن جميع العمليات الرياضية الأساسية فعالة. على الرغم من التحديات المتعلقة بالدقة العددية في دارت، نجحت المكتبة في التنبؤ بدالة موجة جيبية بدقة 92٪ عبر 10000 نقطة بيانات، مما يؤكد صحة وظائفها الأساسية."
    },
    "images": [],
    "tags": ["Machine Learning", "Dart", "From Scratch", "Library"],
    "github": "https://github.com/AlanMet/SineWaveNN",
    "demo": null
  },
  {
    "id": "proj-dart-matrix",
    "title": {
      "en": "Dart Numerical Computing Library",
      "fr": "Bibliothèque de Calcul Numérique en Dart",
      "ar": "مكتبة الحوسبة الرقمية بدارت"
    },
    "summary": {
      "en": "A lightweight and efficient matrix manipulation library in Dart.",
      "fr": "Une bibliothèque de manipulation matricielle légère et efficace en Dart.",
      "ar": "مكتبة معالجة مصفوفات خفيفة وفعالة في لغة دارت."
    },
    "description": {
      "en": "This library was created to provide a lightweight, efficient, and standalone foundation for numerical and scientific computing in Dart. It addresses the need for a dedicated tool for matrix manipulation without the overhead of larger external packages.\n\nIt implements a core `Matrix` class with full support for fundamental operations, including addition, transpose, and dot product. As the foundational layer for the Dart Neural Network library, it also contains specialized utilities within a `nnutils` module, such as implementations of activation functions like softmax and sigmoid, which are critical for building machine learning models from scratch.",
      "fr": "Cette bibliothèque a été créée pour fournir une base légère, efficace et autonome pour le calcul numérique et scientifique en Dart. Elle répond au besoin d'un outil dédié à la manipulation de matrices sans la surcharge des plus grands paquets externes.\n\nElle implémente une classe `Matrix` de base avec un support complet pour les opérations fondamentales, y compris l'addition, la transposition et le produit scalaire. En tant que couche fondamentale de la bibliothèque de réseau neuronal Dart, elle contient également des utilitaires spécialisés dans son module `nnutils`, tels que des implémentations de fonctions d'activation comme softmax et sigmoïde, qui sont essentielles pour construire des modèles d'apprentissage automatique à partir de zéro.",
      "ar": "تم إنشاء هذه المكتبة لتوفير أساس خفيف وفعال ومستقل للحوسبة الرقمية والعلمية في دارت. إنها تلبي الحاجة إلى أداة مخصصة لمعالجة المصفوفات دون العبء الزائد للحزم الخارجية الأكبر.\n\nتنفذ فئة `Matrix` أساسية مع دعم كامل للعمليات الأساسية، بما في ذلك الجمع والنقل والضرب النقطي. كطبقة أساسية لمكتبة الشبكات العصبية في دارت، تحتوي أيضًا على أدوات مساعدة متخصصة داخل وحدة `nnutils` الخاصة بها، مثل تطبيقات وظائف التنشيط مثل softmax و sigmoid، والتي تعتبر حاسمة لبناء نماذج التعلم الآلي من الصفر."
    },
    "images": [],
    "tags": ["Dart", "Linear Algebra", "Numerical Computing"],
    "github": "https://github.com/AlanMet/DartMatrix",
    "demo": null
  },
  {
    "id": "proj-zork-remake",
    "title": {
      "en": "C# Language Parser Engine",
      "fr": "Moteur d'Analyse de Langage C#",
      "ar": "محرك تحليل لغة C#"
    },
    "summary": {
      "en": "A terminal-based adventure game engine with a custom natural language parser.",
      "fr": "Un moteur de jeu d'aventure en mode texte avec un analyseur de langage naturel personnalisé.",
      "ar": "محرك لعبة مغامرات نصي مع محلل لغة طبيعية مخصص."
    },
    "description": {
      "en": "This project, built for an A-Level NEA, is a sophisticated text adventure engine written from the ground up in C#. The primary goal was not just to create a game, but to engineer a robust engine capable of parsing complex, natural language commands.\n\nThe heart of the engine is its command parser, which tokenizes user input and classifies each word by type (verb, noun, preposition). This allows the system to understand multi-word commands and complex sentences. The engine is designed with a modular, object-oriented architecture where rooms, items, and the player are distinct objects, making the world easy to expand and maintain.",
      "fr": "Ce projet, réalisé pour un A-Level NEA, est un moteur d'aventure textuel sophistiqué, entièrement écrit en C#. L'objectif principal n'était pas seulement de créer un jeu, mais de concevoir un moteur robuste capable d'analyser des commandes complexes en langage naturel.\n\nLe cœur du moteur est son analyseur de commandes, qui segmente l'entrée de l'utilisateur et classifie chaque mot par type (verbe, nom, préposition). Cela permet au système de comprendre des commandes de plusieurs mots et des phrases complexes. Le moteur est conçu avec une architecture modulaire et orientée objet où les pièces, les objets et le joueur sont des objets distincts, ce qui rend le monde facile à étendre et à maintenir.",
      "ar": "هذا المشروع، الذي تم بناؤه لـ A-Level NEA، هو محرك مغامرات نصي متطور مكتوب من الصفر بلغة C#. لم يكن الهدف الأساسي مجرد إنشاء لعبة، بل هندسة محرك قوي قادر على تحليل الأوامر المعقدة باللغة الطبيعية.\n\nقلب المحرك هو محلل الأوامر الخاص به، الذي يقوم بتقسيم مدخلات المستخدم وتصنيف كل كلمة حسب النوع (فعل، اسم، حرف جر). هذا يسمح للنظام بفهم الأوامر متعددة الكلمات والجمل المعقدة. تم تصميم المحرك ببنية معيارية وموجهة للكائنات حيث تكون الغرف والعناصر واللاعب كائنات مميزة، مما يجعل العالم سهل التوسيع والصيانة."
    },
    "images": [],
    "tags": ["C#", ".NET", "Game Development", "Engine", "NLP"],
    "github": "https://github.com/AlanMet/Zork",
    "demo": null
  },
  {
    "id": "proj-timeless-echo",
    "title": {
      "en": "Flutter Text Adventure Game",
      "fr": "Jeu d'Aventure Textuelle Flutter",
      "ar": "لعبة مغامرات نصية بفلاتر"
    },
    "summary": {
      "en": "An interactive text-based adventure on Flutter with AI-generated images.",
      "fr": "Une aventure textuelle interactive sur Flutter avec des images générées par IA.",
      "ar": "مغامرة نصية تفاعلية على فلاتر مع صور مولدة بالذكاء الاصطناعي."
    },
    "description": {
      "en": "Timeless Echo is a modern re-imagining of classic text-based adventure games, built as a mobile application using Flutter. It provides a dynamic and engaging interactive fiction experience, moving beyond static narratives to create a persistent world for the player.\n\nThe front-end is built entirely in Flutter, featuring a custom, responsive UI with both light and dark modes. A unique aspect of this project was its use of locally-run AI models (via ComfyUI) for dynamic image generation, aiming to enhance the narrative and create a more immersive and visually rich experience for the player.",
      "fr": "Timeless Echo est une réinterprétation moderne des jeux d'aventure textuels classiques, conçue comme une application mobile utilisant Flutter. Il offre une expérience de fiction interactive dynamique et captivante, dépassant les récits statiques pour créer un monde persistant pour le joueur.\n\nL'interface front-end est entièrement construite en Flutter, avec une interface utilisateur personnalisée et réactive, dotée de modes clair et sombre. Un aspect unique de ce projet était son utilisation de modèles d'IA exécutés localement (via ComfyUI) pour la génération d'images dynamiques, dans le but d'améliorer le récit et de créer une expérience plus immersive et visuellement riche pour le joueur.",
      "ar": "Timeless Echo هو إعادة تصور حديثة لألعاب المغامرات النصية الكلاسيكية، تم بناؤه كتطبيق محمول باستخدام Flutter. يوفر تجربة خيال تفاعلي ديناميكية وجذابة، تتجاوز السرد الثابت لإنشاء عالم مستمر للاعب.\n\nتم بناء الواجهة الأمامية بالكامل باستخدام Flutter، وتتميز بواجهة مستخدم مخصصة ومتجاوبة مع وضعي الإضاءة الفاتح والداكن. كان أحد الجوانب الفريدة لهذا المشروع هو استخدامه لنماذج الذكاء الاصطناعي التي تعمل محليًا (عبر ComfyUI) لتوليد الصور الديناميكية، بهدف تعزيز السرد وإنشاء تجربة غامرة وأكثر ثراءً بصريًا للاعب."
    },
    "images": ["images/preview.png"],
    "tags": ["Flutter", "Firebase", "Mobile", "Game Development", "AI Art"],
    "github": "https://github.com/AlanMet/timeless_echo",
    "demo": null
  },
  {
    "id": "proj-smart-home",
    "title": {
      "en": "Desktop GUI Application Prototype",
      "fr": "Prototype d'Application GUI de Bureau",
      "ar": "نموذج أولي لتطبيق واجهة مستخدم رسومية لسطح المكتب"
    },
    "summary": {
      "en": "A desktop GUI prototype for a smart home dashboard using Python and Tkinter.",
      "fr": "Un prototype d'interface graphique pour un tableau de bord de maison intelligente utilisant Python et Tkinter.",
      "ar": "نموذج أولي لواجهة مستخدم رسومية لسطح المكتب للوحة تحكم منزل ذكي باستخدام بايثون و Tkinter."
    },
    "description": {
      "en": "This project, developed for a university coursework assignment, is a prototype for a smart home management dashboard. The goal was to apply fundamental principles of graphical user interface (GUI) development and event-driven programming in a desktop environment.\n\nBuilt entirely in Python using the standard Tkinter library, the application provides a visual interface for managing simulated smart devices. Users can add new devices to a central dashboard and modify their state (e.g., on/off). The application's state is managed locally, demonstrating core concepts of GUI application architecture.",
      "fr": "Ce projet, développé pour un travail universitaire, est un prototype de tableau de bord de gestion de maison intelligente. L'objectif était d'appliquer les principes fondamentaux du développement d'interfaces utilisateur graphiques (GUI) et de la programmation événementielle dans un environnement de bureau.\n\nConstruite entièrement en Python à l'aide de la bibliothèque standard Tkinter, l'application fournit une interface visuelle pour la gestion d'appareils intelligents simulés. Les utilisateurs peuvent ajouter de nouveaux appareils à un tableau de bord central et modifier leur état (par ex. marche/arrêt). L'état de l'application est géré localement, démontrant les concepts de base de l'architecture d'application GUI.",
      "ar": "هذا المشروع، الذي تم تطويره لمهمة دراسية جامعية، هو نموذج أولي للوحة تحكم لإدارة المنزل الذكي. كان الهدف هو تطبيق المبادئ الأساسية لتطوير واجهة المستخدم الرسومية (GUI) والبرمجة القائمة على الأحداث في بيئة سطح المكتب.\n\nتم بناء التطبيق بالكامل بلغة بايثون باستخدام مكتبة Tkinter القياسية، ويوفر واجهة مرئية لإدارة الأجهزة الذكية المحاكاة. يمكن للمستخدمين إضافة أجهزة جديدة إلى لوحة تحكم مركزية وتعديل حالتها (مثل التشغيل/الإيقاف). تتم إدارة حالة التطبيق محليًا، مما يوضح المفاهيم الأساسية لهندسة تطبيقات واجهة المستخدم الرسومية."
    },
    "images": ["images/preview.png"],
    "tags": ["Python", "Tkinter", "UI/UX", "Desktop Application"],
    "github": "https://github.com/AlanMet/SmartHome",
    "demo": null
  },
  {
    "id": "proj-patchwork",
    "title": {
      "en": "Graphical Pattern Generator",
      "fr": "Générateur de Motifs Graphique",
      "ar": "مولد أنماط رسومي"
    },
    "summary": {
      "en": "A graphical patchwork pattern generator using Python and a graphics library.",
      "fr": "Un générateur de motifs de patchwork graphique utilisant Python et une bibliothèque graphique.",
      "ar": "مولد رسومي لأنماط المرقعة باستخدام بايثون ومكتبة رسوميات."
    },
    "description": {
      "en": "This graphical desktop application allows users to visually create and edit patchwork quilt patterns. Built in Python using Zelle's Graphics library for a university assignment, it provides an interactive tool for designers and hobbyists.\n\nA key technical challenge was a restriction against using object-oriented classes. This was overcome by simulating object behavior using lists to manage the state and properties of graphical elements on the canvas. The application is entirely event-driven, responding to mouse clicks for selection and color changes, demonstrating a creative solution to a common programming constraint.",
      "fr": "Cette application de bureau graphique permet aux utilisateurs de créer et de modifier visuellement des motifs de courtepointe en patchwork. Conçue en Python à l'aide de la bibliothèque graphique de Zelle pour un projet universitaire, elle fournit un outil interactif pour les designers et les amateurs.\n\nUn défi technique clé était une restriction interdisant l'utilisation de classes orientées objet. Cela a été surmonté en simulant le comportement des objets à l'aide de listes pour gérer l'état et les propriétés des éléments graphiques sur le canevas. L'application est entièrement pilotée par les événements, réagissant aux clics de souris pour la sélection et les changements de couleur, démontrant une solution créative à une contrainte de programmation courante.",
      "ar": "يتيح تطبيق سطح المكتب الرسومي هذا للمستخدمين إنشاء وتعديل أنماط لحاف المرقعة بشكل مرئي. تم بناؤه بلغة بايثون باستخدام مكتبة Zelle's Graphics لمهمة جامعية، وهو يوفر أداة تفاعلية للمصممين والهواة.\n\nكان التحدي التقني الرئيسي هو قيد يمنع استخدام الفئات الموجهة للكائنات. تم التغلب على ذلك عن طريق محاكاة سلوك الكائنات باستخدام القوائم لإدارة حالة وخصائص العناصر الرسومية على اللوحة. التطبيق مدفوع بالكامل بالأحداث، ويستجيب لنقرات الماوس للاختيار وتغييرات الألوان، مما يوضح حلاً إبداعيًا لقيود البرمجة الشائعة."
    },
    "images": ["images/preview.png"],
    "tags": ["Python", "Graphics", "Tkinter"],
    "github": "https://github.com/AlanMet/PatchworkApp",
    "demo": null
  }
]
